

##
## DEVICE  "EP2C35F672C7"
##


#**************************************************************
# Time Information
#**************************************************************


#**************************************************************
# Create Clock
#**************************************************************

create_clock -name {CLOCK_27} -period 37.307 [get_ports {CLOCK_27}]

#**************************************************************
# Create Generated Clock
#**************************************************************

#derive_pll_clocks -create_base_clocks
create_generated_clock -name {PIXEL_CLK} -source [get_ports CLOCK_27] -divide_by 2 [get_pins u_pll|altpll_component|pll|clk[0]]

#**************************************************************
# Set Clock Latency
#**************************************************************



#**************************************************************
# Set Clock Uncertainty
#**************************************************************

derive_clock_uncertainty


#**************************************************************
# Set Clock Groups
#**************************************************************


#**************************************************************
# Set False Path
#**************************************************************


#**************************************************************
# Set Multicycle Path
#**************************************************************



#**************************************************************
# Set Maximum Delay
#**************************************************************



#**************************************************************
# Set Minimum Delay
#**************************************************************



#**************************************************************
# Set Input Transition
#**************************************************************



#**************************************************************
# Set Input Delay
#**************************************************************

set_input_delay -clock PIXEL_CLK 10 [get_ports SRAM_DQ[*]]

#**************************************************************
# Set Output Delay
#**************************************************************

set_output_delay -clock PIXEL_CLK 10 [get_ports SRAM_DQ[*] ]
set_output_delay -clock PIXEL_CLK 10 [get_ports SRAM_ADDR[*] ]
set_output_delay -clock PIXEL_CLK 10 [get_ports SRAM_UB_N ]
set_output_delay -clock PIXEL_CLK 10 [get_ports SRAM_LB_N ]
set_output_delay -clock PIXEL_CLK 10 [get_ports SRAM_WE_N ]
set_output_delay -clock PIXEL_CLK 10 [get_ports SRAM_CE_N ]
set_output_delay -clock PIXEL_CLK 10 [get_ports SRAM_OE_N ]